kostantinoss/STM32F401-Interactive-Shell/Core/Src/shell.c
}

void clear_cmd() {
    print_shell("\033[2J");    // Clear screen
    print_shell("\033[H");     // Move cursor to home position
}

void echo_cmd(char *cmd) {
    char *args = cmd + 4;

    while (*args == ' ' || *args == '\t') {
        args++;
    }

    if (*args != '\0') {
        print_shell("%s\r\n", args);
    } else {
        print_shell("\r\n");
    }

}

// void print_gpio_status_cmd_(GPIO_TypeDef *GPIOx, const char *port_name) {
//     /*
//     === GPIOA Status ===
//     Configured Pins:
//       PA2:  AF (USART2), Speed: Low, Pull: None
//       PA3:  AF (USART2), Speed: Low, Pull: None
//       PA5:  Output, Speed: Low, Pull: None, State: LOW
//       PA13: AF (SWDIO), Speed: Very High, Pull: Pull-up
//       PA14: AF (SWCLK), Speed: Low, Pull: Pull-down
//       PA15: AF (SWO), Speed: Low, Pull: Pull-up
//
//     Input States:
//       IDR: 00000000000000001010000000001100 (Pins 2,3,13,15 = HIGH)
//
//     Output States:
//       ODR: 00000000000000000000000000000000 (All outputs LOW)
//     */
//
//     // TODO: Implementation - High-level summary showing only configured pins
//     print_shell("========== %s ==========\r\n", port_name);
//
//     uint32_t mode;
//     char *modes_map[] = {"Reset", "Output", "Alternate Function", "Analog"};
//
//     uint32_t speed;
//     char *speed_map[] = {"Low", "Medium", "High", "Very high"};
//
//     uint32_t pullup;
//     char *pullup_map[] = {"No", "Pull up", "Pull down", "Reserved"};
//
//     for (int pin = 0; pin < 16; pin++) {
//         mode = (GPIOx->MODER >> (pin * 2)) & 0x3UL;
//         if (mode == RESET)
//             continue;
//
//         speed = (GPIOx->OSPEEDR >> (pin * 2)) & 0x3UL;
//         pullup = (GPIOx->PUPDR >> (pin * 2)) & 0x3UL;
//
//         if (mode == 2) {
//             char *af = "test"; //get_af();
//             print_shell(
//                 "Pin %d: %s (%s), Speed: %s, Pull: %s\r\n", pin, modes_map[mode], af, speed_map[speed], pullup_map[pullup]);
//         } else {
//             print_shell("Pin %d: %s, Speed: %s, Pull: %s\r\n", pin, modes_map[mode], speed_map[speed], pullup_map[pullup]);
//         }
//
//     }
// }

void print_gpio_status_cmd(GPIO_TypeDef *GPIOx, const char *port_name) {
    // Helper function to get AF name based on AF number and port
    const char* get_af_name(GPIO_TypeDef *gpio, uint8_t pin, uint8_t af_num) {
        // AF mapping for STM32F401 (simplified common ones)
        // This varies by pin and port, here are the most common:
        switch (af_num) {
            case 0:  return "System";
            case 1:  return "TIM1/TIM2";
            case 2:  return "TIM3/TIM4/TIM5";
            case 3:  return "TIM9/TIM10/TIM11";
            case 4:  return "I2C1/I2C2/I2C3";
            case 5:  return "SPI1/SPI2/SPI3/SPI4";
            case 6:  return "SPI2/SPI3";
            case 7:
                // USART mapping depends on pin
                if (gpio == GPIOA && (pin == 2 || pin == 3)) return "USART2";
                if (gpio == GPIOA && (pin == 9 || pin == 10)) return "USART1";
                return "USART1/USART2";
            case 8:  return "USART6";
            case 9:  return "I2C2/I2C3";
            case 10: return "OTG_FS";
            case 12: return "SDIO";
            case 15: return "EVENTOUT";
            default: return "Reserved";
        }
    }

    print_shell("========== %s Status ==========\r\n", port_name);

    uint32_t mode;
    char *modes_map[] = {"Input", "Output", "Alternate Function", "Analog"};

    uint32_t speed;
    char *speed_map[] = {"Low", "Medium", "High", "Very High"};

    uint32_t pullup;
    char *pullup_map[] = {"None", "Pull-up", "Pull-down", "Reserved"};

    uint32_t otype;
    char *otype_map[] = {"Push-Pull", "Open-Drain"};

    print_shell("Configured Pins:\r\n");

    for (int pin = 0; pin < 16; pin++) {
        mode = (GPIOx->MODER >> (pin * 2)) & 0x3UL;

        // Skip unconfigured pins (input mode with no pull)
        if (mode == 0) {
            uint32_t pull = (GPIOx->PUPDR >> (pin * 2)) & 0x3UL;
            if (pull == 0) continue;  // Default state, skip
        }

        speed = (GPIOx->OSPEEDR >> (pin * 2)) & 0x3UL;
        pullup = (GPIOx->PUPDR >> (pin * 2)) & 0x3UL;
        otype = (GPIOx->OTYPER >> pin) & 0x1UL;

        print_shell("  P%c%d: ", port_name[4], pin);  // Extract port letter from "GPIOA"
        print_shell("%s", modes_map[mode]);

        // For Alternate Function mode, show AF number and name
        if (mode == 2) {  // Alternate Function
            uint8_t af_num;

            // Read from AFR[0] (AFRL) for pins 0-7, AFR[1] (AFRH) for pins 8-15
            if (pin < 8) {
                af_num = (GPIOx->AFR[0] >> (pin * 4)) & 0xFUL;
            } else {
                af_num = (GPIOx->AFR[1] >> ((pin - 8) * 4)) & 0xFUL;
            }

            const char *af_name = get_af_name(GPIOx, pin, af_num);
            print_shell(" (AF%d: %s)", af_num, af_name);
        }

        // Show output type for output/AF modes
        if (mode == 1 || mode == 2) {
            print_shell(", %s", otype_map[otype]);
        }

        print_shell(", Speed: %s, Pull: %s", speed_map[speed], pullup_map[pullup]);

        // For output pins, show current state
        if (mode == 1) {  // Output mode
            uint32_t pin_state = (GPIOx->ODR >> pin) & 0x1UL;
            print_shell(", State: %s", pin_state ? "HIGH" : "LOW");
        }

        // For input/AF pins, show current input state
        if (mode == 0 || mode == 2) {
            uint32_t pin_state = (GPIOx->IDR >> pin) & 0x1UL;
            print_shell(", Input: %s", pin_state ? "HIGH" : "LOW");
        }

        print_shell("\r\n");
    }

    // Show raw register values for reference
    print_shell("\r\nRegister Summary:\r\n");
    print_shell("  IDR: 0x%04X  ", (unsigned int)(GPIOx->IDR & 0xFFFF));
    print_shell("  ODR: 0x%04X\r\n", (unsigned int)(GPIOx->ODR & 0xFFFF));
}

void print_uart_status_cmd(char *args) {
    /*
    === USART2 Status ===
    Configuration:
      Baud Rate:    115200
      Data Bits:    8
      Stop Bits:    1
      Parity:       None
      Mode:         TX + RX
      Flow Control: None

    Pins:
      TX: PA2 (AF7)
      RX: PA3 (AF7)

    Status:
      USART:        Enabled
      TX Buffer:    Empty (ready to send)
      RX Buffer:    Empty (no data)
      Errors:       None

    Statistics:
      Overrun Errors:   0
      Framing Errors:   0
      Parity Errors:    0
    */

    // TODO: Implementation - High-level UART status
}

void showreg_uart(USART_TypeDef* USARTx) {
    /*
    === USART2 Raw Registers ===
    SR:   0x000000C0  (00000000000000000000000011000000)
    DR:   0x00000000  (00000000000000000000000000000000)
    BRR:  0x00000683  (00000000000000000000011010000011)
    CR1:  0x0000200C  (00000000000000000010000000001100)
    CR2:  0x00000000  (00000000000000000000000000000000)
    CR3:  0x00000000  (00000000000000000000000000000000)
    GTPR: 0x00000000  (00000000000000000000000000000000)
    */

