kostantinoss/STM32F401-Interactive-Shell/Core/Src/shell.c
    char buff[33];
    uint32_to_binary_string(USARTx->SR, buff, 33);
    print_shell("SR:   0x%08lX  (%s)\r\n", (unsigned long)USARTx->SR, buff);

    uint32_to_binary_string(USARTx->DR, buff, 33);
    print_shell("DR:   0x%08lX  (%s)\r\n", (unsigned long)USARTx->DR, buff);

    uint32_to_binary_string(USARTx->BRR, buff, 33);
    print_shell("BRR:  0x%08lX  (%s)\r\n", (unsigned long)USARTx->BRR, buff);

    uint32_to_binary_string(USARTx->CR1, buff, 33);
    print_shell("CR1:  0x%08lX  (%s)\r\n", (unsigned long)USARTx->CR1, buff);

    uint32_to_binary_string(USARTx->CR2, buff, 33);
    print_shell("CR2:  0x%08lX  (%s)\r\n", (unsigned long)USARTx->CR2, buff);

    uint32_to_binary_string(USARTx->CR3, buff, 33);
    print_shell("CR3:  0x%08lX  (%s)\r\n", (unsigned long)USARTx->CR3, buff);

    uint32_to_binary_string(USARTx->GTPR, buff, 33);
    print_shell("GTPR: 0x%08lX  (%s)\r\n", (unsigned long)USARTx->GTPR, buff);
}

void showreg_gpio(GPIO_TypeDef *GPIOx) {
    /*
    === GPIOA Raw Registers ===
    MODER:   0xA80004A0  (10101000000000000000010010100000)
    OTYPER:  0x00000000  (00000000000000000000000000000000)
    OSPEEDR: 0x0C000000  (00001100000000000000000000000000)
    PUPDR:   0x64000000  (01100100000000000000000000000000)
    IDR:     0x0000A00C  (00000000000000001010000000001100)
    ODR:     0x00000000  (00000000000000000000000000000000)
    BSRR:    0x00000000  (00000000000000000000000000000000)
    LCKR:    0x00000000  (00000000000000000000000000000000)
    AFR[0]:  0x00007700  (00000000000000000111011100000000)
    AFR[1]:  0x00000000  (00000000000000000000000000000000)
    */

    char buff[33];

    uint32_to_binary_string(GPIOx->MODER, buff, 33);
    print_shell("MODER:   0x%08lX  (%s)\r\n", (unsigned long)GPIOx->MODER, buff);

    uint32_to_binary_string(GPIOx->OTYPER, buff, 33);
    print_shell("OTYPER:  0x%08lX  (%s)\r\n", (unsigned long)GPIOx->OTYPER, buff);

    uint32_to_binary_string(GPIOx->OSPEEDR, buff, 33);
    print_shell("OSPEEDR: 0x%08lX  (%s)\r\n", (unsigned long)GPIOx->OSPEEDR, buff);

    uint32_to_binary_string(GPIOx->PUPDR, buff, 33);
    print_shell("PUPDR:   0x%08lX  (%s)\r\n", (unsigned long)GPIOx->PUPDR, buff);

    uint32_to_binary_string(GPIOx->IDR, buff, 33);
    print_shell("IDR:     0x%08lX  (%s)\r\n", (unsigned long)GPIOx->IDR, buff);

    uint32_to_binary_string(GPIOx->ODR, buff, 33);
    print_shell("ODR:     0x%08lX  (%s)\r\n", (unsigned long)GPIOx->ODR, buff);

    uint32_to_binary_string(GPIOx->BSRR, buff, 33);
    print_shell("BSRR:    0x%08lX  (%s)\r\n", (unsigned long)GPIOx->BSRR, buff);

    uint32_to_binary_string(GPIOx->LCKR, buff, 33);
    print_shell("LCKR:    0x%08lX  (%s)\r\n", (unsigned long)GPIOx->LCKR, buff);

    uint32_to_binary_string(GPIOx->AFR[0], buff, 33);
    print_shell("AFR[0]:  0x%08lX  (%s)\r\n", (unsigned long)GPIOx->AFR[0], buff);

    uint32_to_binary_string(GPIOx->AFR[1], buff, 33);
    print_shell("AFR[1]:  0x%08lX  (%s)\r\n", (unsigned long)GPIOx->AFR[1], buff);
}

void print_rcc_status_cmd() {
    /*
    === Clock Configuration Status ===
    Clock Sources:
      HSI:  Ready
      HSE:  Ready
      PLL:  Ready, Active

    System Clocks:
      SYSCLK:  84 MHz  (Source: PLL)
      HCLK:    84 MHz  (AHB Prescaler: /1)
      PCLK1:   42 MHz  (APB1 Prescaler: /2)
      PCLK2:   84 MHz  (APB2 Prescaler: /1)

    PLL Configuration:
      Source:  HSE (8 MHz)
      M:       8   (VCO Input: 1 MHz)
      N:       336 (VCO Output: 336 MHz)
      P:       2   (Main PLL: 168 MHz)
      Q:       7   (USB/SDIO: 48 MHz)

    Enabled Peripherals:
      AHB1: GPIOA, GPIOC, DMA2
      APB1: USART2, TIM2
      APB2: SYSCFG
    */

    // TODO: Implementation - High-level clock status
}

void showreg_rcc() {
    /*
    === RCC Raw Registers ===
    CR:       0x03010083  (00000011000000010000000010000011)
    PLLCFGR:  0x24403010  (00100100010000000011000000010000)
    CFGR:     0x00001402  (00000000000000000001010000000010)
    CIR:      0x00000000  (00000000000000000000000000000000)
    AHB1RSTR: 0x00000000  (00000000000000000000000000000000)
    AHB2RSTR: 0x00000000  (00000000000000000000000000000000)
    APB1RSTR: 0x00000000  (00000000000000000000000000000000)
    APB2RSTR: 0x00000000  (00000000000000000000000000000000)
    AHB1ENR:  0x00100005  (00000000000100000000000000000101)
    AHB2ENR:  0x00000000  (00000000000000000000000000000000)
    APB1ENR:  0x00001100  (00000000000000000001000100000000)
    APB2ENR:  0x00004000  (00000000000000000100000000000000)
    */

    char buff[33];

    print_shell("=== RCC Raw Registers ===\r\n");

    uint32_to_binary_string(RCC->CR, buff, 33);
    print_shell("CR:       0x%08lX  (%s)\r\n", (unsigned long)RCC->CR, buff);

    uint32_to_binary_string(RCC->PLLCFGR, buff, 33);
    print_shell("PLLCFGR:  0x%08lX  (%s)\r\n", (unsigned long)RCC->PLLCFGR, buff);

    uint32_to_binary_string(RCC->CFGR, buff, 33);
    print_shell("CFGR:     0x%08lX  (%s)\r\n", (unsigned long)RCC->CFGR, buff);

    uint32_to_binary_string(RCC->CIR, buff, 33);
    print_shell("CIR:      0x%08lX  (%s)\r\n", (unsigned long)RCC->CIR, buff);

    uint32_to_binary_string(RCC->AHB1RSTR, buff, 33);
    print_shell("AHB1RSTR: 0x%08lX  (%s)\r\n", (unsigned long)RCC->AHB1RSTR, buff);

    uint32_to_binary_string(RCC->AHB2RSTR, buff, 33);
    print_shell("AHB2RSTR: 0x%08lX  (%s)\r\n", (unsigned long)RCC->AHB2RSTR, buff);

    uint32_to_binary_string(RCC->APB1RSTR, buff, 33);
    print_shell("APB1RSTR: 0x%08lX  (%s)\r\n", (unsigned long)RCC->APB1RSTR, buff);

    uint32_to_binary_string(RCC->APB2RSTR, buff, 33);
    print_shell("APB2RSTR: 0x%08lX  (%s)\r\n", (unsigned long)RCC->APB2RSTR, buff);

    uint32_to_binary_string(RCC->AHB1ENR, buff, 33);
    print_shell("AHB1ENR:  0x%08lX  (%s)\r\n", (unsigned long)RCC->AHB1ENR, buff);

    uint32_to_binary_string(RCC->AHB2ENR, buff, 33);
    print_shell("AHB2ENR:  0x%08lX  (%s)\r\n", (unsigned long)RCC->AHB2ENR, buff);

    uint32_to_binary_string(RCC->APB1ENR, buff, 33);
    print_shell("APB1ENR:  0x%08lX  (%s)\r\n", (unsigned long)RCC->APB1ENR, buff);

    uint32_to_binary_string(RCC->APB2ENR, buff, 33);
    print_shell("APB2ENR:  0x%08lX  (%s)\r\n", (unsigned long)RCC->APB2ENR, buff);
}

void print_timer_status_cmd(char *args) {
    /*
    === TIM1 Status ===
    Configuration:
      Status:       Disabled
      Mode:         PWM Mode 1
      Direction:    Up-counting
      Clock Source: Internal (84 MHz)

    Timing:
      Prescaler:    0 (Clock: 84 MHz)
      Period (ARR): 65535
      Frequency:    1.28 kHz

    Channels:
      CH1: Disabled, CCR=0
      CH2: Disabled, CCR=0
      CH3: Disabled, CCR=0
      CH4: Disabled, CCR=0

    Current State:
      Counter:      0
      Interrupt:    Update flag set
    */

    // TODO: Implementation - High-level timer status
}

void showreg_timer1() {
    /*
    === TIM1 Raw Registers ===
    CR1:   0x00000000  (00000000000000000000000000000000)
    CR2:   0x00000000  (00000000000000000000000000000000)
    SMCR:  0x00000000  (00000000000000000000000000000000)
    DIER:  0x00000000  (00000000000000000000000000000000)
    SR:    0x00000001  (00000000000000000000000000000001)
    EGR:   0x00000000  (00000000000000000000000000000000)
    CCMR1: 0x00000000  (00000000000000000000000000000000)
    CCMR2: 0x00000000  (00000000000000000000000000000000)
    CCER:  0x00000000  (00000000000000000000000000000000)
    CNT:   0x00000000  (00000000000000000000000000000000)
    PSC:   0x00000000  (00000000000000000000000000000000)
    ARR:   0x0000FFFF  (00000000000000001111111111111111)
    CCR1:  0x00000000  (00000000000000000000000000000000)
    CCR2:  0x00000000  (00000000000000000000000000000000)
    CCR3:  0x00000000  (00000000000000000000000000000000)
    CCR4:  0x00000000  (00000000000000000000000000000000)
    */

    // TODO: Implementation - Raw register dump
}